<?php

namespace Database\Seeders;

use App\Models\Option;
use App\Models\Question;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class OptionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        $questionsQuiz1 = Question::where('quiz_id', 1)->get();
        $questionsQuiz2 = Question::where('quiz_id', 2)->get();

        // Options for Quiz 1: Основни финансиски вештини
        $optionsQuiz1 = [
            ['Не треба да се следат', 'Преку пишување во тетратка', 'Преку пишување во тетратка, ексел-табели или апликации за следење на буџетот'],
            ['Трошок', 'Чување на пари за идни потреби', 'Инвестирање во ризични средства'],
            ['Не треба да се поставува', 'Со разгледување на месечните примања и трошоци', 'Само преку штедење'],
            ['Процент на профит', 'Процент што се плаќа за задолжување', 'Трошок за набавка на стоки'],
            ['Инвестирање во еден вид средство', 'Инвестирање во различни средства за намалување на ризик', 'Краткорочно инвестирање'],
            ['Достапност на средства', 'Задолжување', 'Ризични инвестиции'],
            ['Ризик од неплаќање на кредит', 'Ризик од губење на инвестиција', 'Ризик од висок долг'],
            ['Инвестирање во еден сектор', 'Диверзификација е купување на различни видови средства', 'Диверзификација е штедење'],
            ['Инвестирање само во ризични средства', 'Инвестирање во различни средства', 'Задолжување'],
            ['Фиксни трошоци се секогаш исти', 'Варијабилни трошоци се зависни од продажбата', 'Фиксни трошоци се ниски, а варијабилни се високи']
        ];

        foreach ($questionsQuiz1 as $index => $question) {
            foreach ($optionsQuiz1[$index] as $key => $option) {
                Option::create([
                    'question_id' => $question->id,
                    'option_text' => $option,
                    'is_correct' => $key === 2
                ]);
            }
        }

        // Options for Quiz 2: Управување со буџет
        $optionsQuiz2 = [
            ['Листа на сите приходи', 'План за управување со трошоците и приходите', 'Извештај за трошоци'],
            ['Непланирано трошење', 'Прецизно планирање на трошоците', 'Зголемување на приходите'],
            ['Приходи, трошоци и заштеди', 'Само трошоци и приходи', 'Само приходите'],
            ['Избалансиран буџет', 'Трошоци поголеми од приходите', 'Приходи поголеми од трошоците'],
            ['Со правење план', 'Со непланирано трошење', 'Со поставување на финансиски цели'],
            ['Штедење е задолжување', 'Задолжување е земање кредит', 'Штедење и задолжување се исти'],
            ['Кога приходите се високи', 'Во секое време', 'Во периоди на економска криза'],
            ['Со правење план', 'Со кредитна картичка', 'Со земање нов долг'],
            ['За да се спречат финансиски кризи', 'За да се троши повеќе', 'Нема потреба од итен фонд'],
            ['Со импулсивно трошење', 'Со планирање на купувањата', 'Со земање кредити']
        ];

        foreach ($questionsQuiz2 as $index => $question) {
            foreach ($optionsQuiz2[$index] as $key => $option) {
                Option::create([
                    'question_id' => $question->id,
                    'option_text' => $option,
                    'is_correct' => $key === 1
                ]);
            }
        }
    }
}
